package week4.nrkim.programmers;

/**
 * PackageName : week4.nrkim.programmers
 * FileName    : 콜라_문제
 * Author      : 김누리(NRKim)
 * Date        : 2025-06-20
 * Description :
 * =====================================================================================================================
 * DATE          AUTHOR               NOTE
 * ---------------------------------------------------------------------------------------------------------------------
 * 2025. 06. 20.     김누리(NRKim)               Initial creation
 */


/*
콜라병(n)이 2개 미만이 될 때 까지 반복

콜라병 n개는 결국 a개로 나눈 값에

case 1 :
20 >> 20 / 2 >>> 10
10 >> 10 / 2 >>> 5
 5 >> 5 / 2 >>> 2 (받은거) + 1 (나머지)
 2 >> 2 / 2 >>> 1 (받은거) + 1 (나머지)
 2 >> 2 / 2 >>> 1

 ※  받은것들만 다 더하면 10 5 2 1 1 >> 19

 case 2 :
 20 >> 20 / 3 >> 6 + 2
  8 >>  8 / 3 >> 2 + 2
  4 >>  4 / 3 >> 1 + 2
  3 >>  3 / 3 >> 0

  총 6 + 2 + 1 == 9개


*/


public class 콜라_문제 {
	public int solution(int a, int b, int n) {
		int answer = 0;

		while (n >= a) {
			answer += (n/a) * b;  // 콜라 병 받는 갯수
			n = (n/a) * b + (n%a);  // 수중의 콜라병 수
		}

		return answer;
	}
}
